{
  "name": "HabitatRiskAssessment",
  "displayName": "Habitat Risk Assessment",
  "description": "The condition of a habitat is a key determinant of the ecosystem services it can provide. For example, multiple stressors including fishing, climate change, pollution and coastal development threaten the ability of coastal ecosystems to provide the valuable goods and services that people want and need. As human activities continue to intensify, so too does the need for quick, clear and repeatable ways of assessing the risks posed by human activities under various management plans. The InVEST habitat risk assessment (HRA) model allows users to assess the risk posed to coastal and marine habitats by human activities and the potential consequences of exposure for the delivery of ecosystem services and biodiversity. The InVEST HRA model is similar to the InVEST biodiversity model in that both models allow users to identify regions on a landscape or seascape where human impacts are highest. While the biodiversity model is intended to be used to assess how human activities impact biodiversity, the HRA model is better suited to screening the risk of current and future human activities to prioritize management strategies that best mitigate risk. We built and tested the HRA model in marine and coastal systems, and discuss it accordingly, but it easily can be applied to terrestrial systems, or mobile species.\n\n\nRisk of human activities (e.g., salmon aquaculture, coastal development, etc.) to habitats (e.g., seagrasses, kelp forests, mangroves, reefs) is a function of the exposure of each habitat to each activity and the consequences for each habitat. Exposure to stressors can arise through direct overlap in space and time or through indirect effects (i.e. finfish farms in an enclosed bay may degrade water quality and thus impede eelgrass growth throughout the bay, even if the netpens are not situated directly over eelgrass beds). Consequence depends on the effects of activities on habitat area and density, and the ability of habitats to recover from these effects (i.e. through processes such as recruitment and regeneration). Outputs from the model are useful for understanding the relative risk of human activities and climate change to habitats within a study region and among alternative future scenarios. Model outputs can help identify areas on the seascape where human activities may create trade-offs among ecosystem services by posing risk high enough to compromise habitat structure and function. The model can help to prioritize areas for conservation and inform the design and configuration of spatial plans for both marine and terrestrial systems.",
  "category": "",
  "helpUrl": "https://lb.telecoupling.msu.edu/arcgis/rest/directories/arcgisoutput/Geoprocessing/HabitatRiskAssessment_GPServer/Geoprocessing_HabitatRiskAssessment/HabitatRiskAssessment.htm",
  "serverInfo": {
    "currentVersion": 10.41,
    "url": "https://lb.telecoupling.msu.edu/arcgis/rest/services/Geoprocessing/HabitatRiskAssessment/GPServer/",
    "hasResultMapServer": false,
    "resultMapServerName": "",
    "supportsUpload": true,
    "maxUploadFileSize": 2000
  },
  "useResultMapServer": false,
  "taskUrl": "https://lb.telecoupling.msu.edu/arcgis/rest/services/Geoprocessing/HabitatRiskAssessment/GPServer/Habitat Risk Assessment",
  "isSynchronous": false,
  "inputParams": [
    {
      "name": "Species_Habitat_Shapefile__zipped_",
      "dataType": "GPDataFile",
      "description": "Zipped shapefile for a habitat/species of interest",
      "defaultValue": "itemID:",
      "category": "",
      "label": "Species/Habitat Shapefile (zipped)",
      "visible": true,
      "required": true,
      "tooltip": "Species/Habitat Shapefile (zipped)"
    },
    {
      "name": "Stressors_Shapefiles__zipped_",
      "dataType": "GPDataFile",
      "description": "Zipped shapefiles representing human stressors for the habitat/species of interest",
      "defaultValue": "itemID:",
      "category": "",
      "label": "Stressors Shapefiles (zipped)",
      "visible": true,
      "required": true,
      "tooltip": "Stressors Shapefiles (zipped)"
    },
    {
      "name": "Spatially_Explicit_Criteria_Folders__zipped_",
      "dataType": "GPDataFile",
      "description": "Zipped folders with spatially-explicit criteria",
      "defaultValue": "itemID:",
      "category": "",
      "label": "Spatially-Explicit Criteria Folders (zipped) (Optional)",
      "visible": true,
      "required": false,
      "tooltip": "Spatially-Explicit Criteria Folders (zipped) (Optional)"
    },
    {
      "name": "Criteria_Scores_Files__zipped_",
      "dataType": "GPDataFile",
      "description": "Zipped folder containing both criteria ratings and stressor buffer CSV tables ",
      "defaultValue": "itemID:",
      "category": "",
      "label": "Criteria Scores Files (zipped)",
      "visible": true,
      "required": true,
      "tooltip": "Criteria Scores Files (zipped)"
    },
    {
      "name": "Resolution_of_Analysis__meters_",
      "dataType": "GPDouble",
      "description": "The size in meters that is desired for the analysis of the shapefile layers at a grid cell scale. This will define the width and height of each unique risk grid cell. This must be a whole number. The user should base this size on the resolution of the habitat data and scale at which habitats are distributed in space. For example, small patches of seagrasses and kelp are often about 100-200 square meters, which is about the smallest resolution we recommend running the model. If the input habitat data are coarse, then a minimum of 500 meters is better. If you examine your risk outputs and find that the edges of patches of habitat have regular and distinct variation in risk, such that every high and medium risk cell on the edge of habitat patches are border by low risk cells, consider enlargening your resolution. We recommend running the model for the first time at a low resolution (500 m or 1 km) to verify that the model is running properly. Then use a higher resolution in subsequent runs.",
      "defaultValue": null,
      "category": "",
      "label": "Resolution of Analysis (meters)",
      "visible": true,
      "required": true,
      "tooltip": "Resolution of Analysis (meters)"
    },
    {
      "name": "Risk_Equation",
      "dataType": "GPString",
      "description": "This selection chooses the equation that will be used when calculating risk to a given habitat. The user may choose either either a Euclidean risk model, or a Multiplicative risk model. See online documentation of InVEST HRA model for more details.",
      "defaultValue": "Euclidean",
      "category": "",
      "choiceList": [
        "Euclidean",
        "Multiplicative"
      ],
      "label": "Risk Equation",
      "visible": true,
      "required": true,
      "tooltip": "Risk Equation"
    },
    {
      "name": "Decay_Equation",
      "dataType": "GPString",
      "description": "This selection influences how the “zone of influence” (i.e., buffer distance) of a stressor will be applied to risk. The stressor buffer distance in the stressor buffer CSV can be degraded to provide a more accurate depiction of the influence of a stressor beyond its footprint. The decay equation decays the overall exposure rating (e.g., combined spatial overlap, temporal overlap, intensity, management effectiveness) before the value for E goes into the risk equation. For each pixel, the model uses the value of the decayed exposure score. The options for decay are as follows. “None” will apply the full exposure to the full range of the stressor footprint plus buffer, without any decay. “Linear” and “Exponential” will use the stated equation as a model for decay from the edges of the footprint to the extent of the buffer distance.",
      "defaultValue": "None",
      "category": "",
      "choiceList": [
        "None",
        "Linear",
        "Exponential"
      ],
      "label": "Decay Equation",
      "visible": true,
      "required": true
    },
    {
      "name": "Maximum_Criteria_Score",
      "dataType": "GPLong",
      "description": "The maximum criteria score is the user-reported highest value assigned to any criteria rating within the assessment. This will be used as the upper bounded value against which all rating scores will be compared. For example, in a model run where the ratings scores vary from 0-3, this would be a 3. If the user chooses to use a different scale for ratings, however, this should be the highest value that could be potentially assigned to a criteria. If the model run is using spatially explicit criteria, this value should be the maximum value assigned to either a criteria feature or to a CSV criteria rating.",
      "defaultValue": null,
      "category": "",
      "label": "Maximum Criteria Score",
      "visible": true,
      "required": true,
      "tooltip": "Maximum Criteria Score"
    },
    {
      "name": "Maximum_Overlapping_Stressors",
      "dataType": "GPLong",
      "description": "The is the largest number of stressors that overlap withing the analysis zone. This will be used in order to make determinations of low, medium, and high risk for a given habitat. If the number of overlapping stressors provided is too low, results will likely show more medium and high risk areas than are present. Conversely, if the number of overlapping stressors is too high, it will be difficult for areas to break the threshold to show up as medium or high risk. If unsure how many stressors overlap, we recommend running the overlap analysis tool without weighting.",
      "defaultValue": null,
      "category": "",
      "label": "Maximum Overlapping Stressors",
      "visible": true,
      "required": true,
      "tooltip": "Maximum Overlapping Stressors"
    },
    {
      "name": "Subregions__Zipped_",
      "dataType": "GPDataFile",
      "description": "Zipped shapefile representing one or more subregions within the study area for management purposes. If only a single region is provided, the results will not be differentiated by sub areas.",
      "defaultValue": "itemID:",
      "category": "",
      "label": "Subregions (Zipped)",
      "visible": true,
      "required": true,
      "tooltip": "Subregions (Zipped)"
    }
  ],
  "outputParams": [
    {
      "name": "Output_Risk_Shapefiles",
      "dataType": "GPFeatureRecordSetLayer",
      "description": "",
      "defaultValue": {
        "displayFieldName": "",
        "geometryType": "esriGeometryPolygon",
        "spatialReference": {
          "wkid": 26910,
          "latestWkid": 26910
        },
        "fields": [
          {
            "name": "FID",
            "type": "esriFieldTypeOID",
            "alias": "FID"
          },
          {
            "name": "VALUE",
            "type": "esriFieldTypeDouble",
            "alias": "VALUE"
          },
          {
            "name": "CLASSIFY",
            "type": "esriFieldTypeString",
            "alias": "CLASSIFY",
            "length": 80
          },
          {
            "name": "Shape_Length",
            "type": "esriFieldTypeDouble",
            "alias": "Shape_Length"
          },
          {
            "name": "Shape_Area",
            "type": "esriFieldTypeDouble",
            "alias": "Shape_Area"
          }
        ],
        "features": [],
        "exceededTransferLimit": false
      },
      "category": "",
      "label": "Relative Habitat Risk",
      "visible": true,
      "required": false,
      "featureSetMode": "layers",
      "tooltip": "Relative Habitat Risk",
      "renderer": {
        "type": "uniqueValue",
        "field1": "CLASSIFY",
        "defaultSymbol": {
          "color": [
            192,
            80,
            77,
            255
          ],
          "outline": {
            "color": [
              160,
              63,
              60,
              255
            ],
            "width": 1.5,
            "type": "esriSLS",
            "style": "esriSLSSolid",
            "marker": null
          },
          "type": "esriSFS",
          "style": "esriSFSSolid"
        },
        "uniqueValueInfos": [
          {
            "value": "HIGH",
            "symbol": {
              "color": [
                192,
                80,
                77,
                255
              ],
              "outline": {
                "color": [
                  160,
                  63,
                  60,
                  255
                ],
                "width": 0,
                "type": "esriSLS",
                "style": "esriSLSSolid",
                "marker": null
              },
              "type": "esriSFS",
              "style": "esriSFSSolid"
            },
            "label": "HIGH",
            "description": "HIGH"
          },
          {
            "value": "MED",
            "symbol": {
              "color": [
                255,
                247,
                153,
                255
              ],
              "outline": {
                "color": [
                  151,
                  151,
                  149,
                  255
                ],
                "width": 0,
                "type": "esriSLS",
                "style": "esriSLSSolid",
                "marker": null
              },
              "type": "esriSFS",
              "style": "esriSFSSolid"
            },
            "label": "MEDIUM",
            "description": "MEDIUM"
          },
          {
            "value": "LOW",
            "symbol": {
              "color": [
                79,
                129,
                189,
                128
              ],
              "outline": {
                "color": [
                  54,
                  93,
                  141,
                  255
                ],
                "width": 0,
                "type": "esriSLS",
                "style": "esriSLSSolid",
                "marker": null
              },
              "type": "esriSFS",
              "style": "esriSFSSolid"
            },
            "label": "LOW",
            "description": "LOW"
          }
        ]
      },
      "popup": {
        "title": "Relative Habitat Risk",
        "fields": [
          {
            "name": "CLASSIFY",
            "alias": "CLASSIFY",
            "type": "esriFieldTypeString"
          },
          {
            "name": "Shape_Length",
            "alias": "Shape_Length",
            "type": "esriFieldTypeDouble"
          },
          {
            "name": "Shape_Area",
            "alias": "Shape_Area",
            "type": "esriFieldTypeDouble"
          }
        ],
        "enablePopup": true
      }
    },
    {
      "name": "Output_Reports",
      "dataType": "GPDataFile",
      "description": "",
      "defaultValue": null,
      "category": "",
      "label": "Habitat Risk Assessment Report",
      "visible": true,
      "required": false,
      "tooltip": "Habitat Risk Assessment Report"
    }
  ],
  "shareResults": true,
  "layerOrder": [
    "Output_Risk_Shapefiles"
  ],
  "showExportButton": true,
  "useDynamicSchema": false
}