{"name":"HabitatQuality","displayName":"Habitat Quality","description":"The InVEST Habitat Quality model uses habitat quality and rarity as proxies to represent the biodiversity of a landscape, estimating the extent of habitat and vegetation types across a landscape, and their state of degradation. The model combines maps of land use land cover (LULC) with data on threats to habitats and habitat response. Modeling habitat quality alongside ecosystem services enables users to compare spatial patterns and identify areas where conservation will most benefit natural systems and protect threatened species. This model does not attempt to place a monetary value on biodiversity.","category":"","helpUrl":"https://lb.telecoupling.msu.edu/arcgis/rest/directories/arcgisoutput/Geoprocessing/HabitatQuality_GPServer/Geoprocessing_HabitatQuality/HabitatQuality.htm","serverInfo":{"currentVersion":10.41,"url":"https://lb.telecoupling.msu.edu/arcgis/rest/services/Geoprocessing/HabitatQuality/GPServer/","hasResultMapServer":true,"resultMapServerName":"Geoprocessing/HabitatQuality","supportsUpload":true,"maxUploadFileSize":2000},"useResultMapServer":true,"taskUrl":"https://lb.telecoupling.msu.edu/arcgis/rest/services/Geoprocessing/HabitatQuality/GPServer/Habitat Quality","isSynchronous":false,"inputParams":[{"name":"Land_Cover_Raster","dataType":"GPRasterDataLayer","description":"A GDAL-supported raster file. The current LULC must have its' own threat rasters, where each threat raster file path has a suffix of _c.","defaultValue":"itemID:","category":"","label":"Land Cover Raster","visible":true,"required":true,"tooltip":"Land Cover Raster"},{"name":"Folder_Containing_Threat_Rasters","dataType":"GPDataFile","description":"The selected folder is used as the location to find all threat rasters for the threats listed in the below table.","defaultValue":"itemID:","category":"","label":"Zipped Folder Containing Threat Rasters","visible":true,"required":true,"tooltip":"Zipped Folder Containing Threat Rasters"},{"name":"Threats_Data","dataType":"GPDataFile","description":"A CSV file of all the threats for the model to consider. Each row in the table is a degradation source and each column contains a different attribute of each degradation source (THREAT, MAX_DIST, WEIGHT).THREAT:The name of the threat source and this name must match exactly to the name of the threat raster and to the name of it's corresponding column in the sensitivity table. NOTE:The threat raster path should have a suffix indicator ( _c, _f, _b ) and the sensitivity column should have a prefix indicator (L_). The THREAT name in the threat table should not include either the suffix or prefix. MAX_DIST:A number in kilometres (km) for the maximum distance a threat has an affect.WEIGHT: A floating point value between 0 and 1 for the the threats weight relative to the other threats. Depending on the type of habitat under review, certain threats may cause greater degradation than other threats.DECAY:A string value of either exponentialor linearrepresenting the type of decay over space for the threat.See the user's guide for valid values for these columns.","defaultValue":"itemID:","category":"","label":"Threats Data","visible":true,"required":true,"tooltip":"Threats Data"},{"name":"Accessibility_to_Threats","dataType":"GPDataFile","description":"An OGR-supported vector file. The input contains data on the relative protection that legal / institutional / social / physical barriers provide against threats. The vector file should contain polygons with a field ACCESS. The ACCESSvalues should range from 0 - 1, where 1 is fully accessible. Any cells not covered by a polygon will be set to 1.","defaultValue":"itemID:","category":"","label":"Accessibility to Threats (optional)","visible":true,"required":false,"tooltip":"Accessibility to Threats (optional)"},{"name":"Sensitivity_of_Land_Cover_Types_to_Each_Threat","dataType":"GPDataFile","description":"A CSV file of LULC types, whether or not the are considered habitat, and, for LULC types that are habitat, their specific sensitivity to each threat. Each row is a LULC type with the following columns: LULC, HABITAT, L_THREAT1, L_THREAT2, ...LULC:Integer values that reflect each LULC code found in current, future, and baseline rasters.HABITAT:A value of 0 or 1 (presence / absence) or a value between 0 and 1 (continuum) depicting the suitability of habitat.L_THREATN:Each L_THREATN should match exactly with the threat names given in the threat CSV file, where the THREATN is the name that matches. This is an floating point value between 0 and 1 that represents the sensitivity of a habitat to a threat. Please see the users guide for more detailed information on proper column values and column names for each threat.","defaultValue":"itemID:","category":"","label":"Sensitivity of Land Cover Types to Each Threat","visible":true,"required":true,"tooltip":"Sensitivity of Land Cover Types to Each Threat"},{"name":"Half_Saturation_Constant","dataType":"GPDouble","description":"A positive floating point value that is defaulted at 0.5. This is the value of the parameter k in equation (4). In general, set k to half of the highest grid cell degradation value on the landscape. To perform this model calibration the model must be run once in order to find the highest degradation value and set k for the provided landscape. Note that the choice of k only determines the spread and central tendency of habitat quality cores and does not affect the rank.","defaultValue":0.5,"category":"","label":"Half Saturation Constant","visible":true,"required":true,"tooltip":"Half Saturation Constant"}],"outputParams":[{"name":"Output_Habitat_Degradation","dataType":"GPRasterDataLayer","description":"","defaultValue":null,"category":"","label":"Relative Habitat Degradation","visible":true,"required":false,"tooltip":"Relative Habitat Degradation"},{"name":"Output_Habitat_Quality","dataType":"GPRasterDataLayer","description":"","defaultValue":null,"category":"","label":"Relative Habitat Quality","visible":true,"required":false,"tooltip":"Relative Habitat Quality"},{"name":"Geoprocessing/HabitatQuality","label":"Habitat Quality","tooltip":"Habitat Quality","dataType":"MapServiceLayer","layerNames":["Habitat Quality","Output Habitat Degradation","Output Habitat Quality"],"visible":true,"required":"","defaultValue":null}],"shareResults":false,"layerOrder":[],"showExportButton":true,"useDynamicSchema":false}
