{"name":"Fisheries","displayName":"Fisheries Harvest","description":"Wild capture fisheries provide a significant source of protein for human consumption and directly employ nearly 40 million fishers worldwide (FAO 2014). However, poor harvesting practices and habitat loss and degradation can reduce the ability of ecosystems to support healthy, productive fisheries. The InVEST Fisheries Production model produces estimates of harvest volume and economic value of single-species fisheries. The model is an age- or stage-structured population model, and is presented as a generic model that can be adapted to most species and geographies. Inputs to the model include parameters for life history characteristics (e.g., age at maturity, recruitment, migration and natural mortality rates), behavior of the fishery (e.g., fishing pressure), habitat dependencies (e.g., importance and availability of nursery habitat), and, optionally, economic valuation (e.g., price per unit biomass). The model outputs the volume and economic value of harvest within the area(s) designated by the user. It is best to compare outputs from multiple runs of the model, where each run represents different scenarios of habitat extent, environmental conditions and/or fishing pressure. A library of four sample models is provided, which the user can adapt to their own species or region, or the user can choose to build a model from scratch.","category":"","helpUrl":"https://lb.telecoupling.msu.edu/arcgis/rest/directories/arcgisoutput/Geoprocessing/FisheriesHarvest_GPServer/Geoprocessing_FisheriesHarvest/Fisheries.htm","serverInfo":{"currentVersion":10.41,"url":"https://lb.telecoupling.msu.edu/arcgis/rest/services/Geoprocessing/FisheriesHarvest/GPServer/","hasResultMapServer":true,"resultMapServerName":"Geoprocessing/FisheriesHarvest","supportsUpload":true,"maxUploadFileSize":2000},"useResultMapServer":true,"taskUrl":"https://lb.telecoupling.msu.edu/arcgis/rest/services/Geoprocessing/FisheriesHarvest/GPServer/Fisheries Harvest","isSynchronous":false,"inputParams":[{"name":"Area_of_Interest","dataType":"GPDataFile","description":"The provided shapefile is used to display outputs within the area of interest. The shapefile must contain a column titled \"Name\", which corresponds to the subregion specified in the Population Parameters CSV file.","defaultValue":"itemID:","category":"","label":"Area of Interest Shapefile","visible":true,"required":true,"tooltip":"Area of Interest Shapefile"},{"name":"Number_of_Steps_for_Model_Run","dataType":"GPDouble","description":"The number of time steps the simulation shall execute before completion. Must be a positive integer.","defaultValue":100,"category":"","label":"Number of Steps for Model Run","visible":true,"required":true,"tooltip":"Number of Steps for Model Run"},{"name":"Population_Model_Type","dataType":"GPString","description":"Specifies whether the classes provided in the Population Parameters CSV file represent ages or stages. If the stage-based model is selected, the Population Parameters CSV File must include a ‘Duration’ vector alongside the survival matrix that contains the number of time steps that each stage lasts.","defaultValue":"Age-Based","category":"","choiceList":["Age-Based","Stage-Based"],"label":"Population Model Type","visible":true,"required":true,"tooltip":"Population Model Type"},{"name":"Population_Classes_are_Sex_Specific","dataType":"GPString","description":"Specifies whether or not the population classes provided in the Population Parameters File are distinguished by sex.","defaultValue":"No","category":"","choiceList":["No","Yes"],"label":"Population Classes are Sex-Specific","visible":true,"required":true,"tooltip":"Population Classes are Sex-Specific"},{"name":"Harvest_by_Individuals_or_Weight","dataType":"GPString","description":"Specifies whether the harvest output values are calculated in terms of number of individuals or in terms of biomass (weight). If ‘Weight’ is selected, the Population Parameters CSV File must include a ‘Weight’ vector alongside the survival matrix that contains the weight of each age/stage, as well as sex if the model is sex-specific.","defaultValue":"Weight","category":"","choiceList":["Individuals","Weight"],"label":"Harvest by Individuals or Weight","visible":true,"required":true,"tooltip":"Harvest by Individuals or Weight"},{"name":"Population_Parameters_File__CSV_","dataType":"GPDataFile","description":"The provided CSV file should contain all necessary parameters for population groups based on age/stage, sex, and subregion:Classes (required)- The leftmost column should contain the age/stage names of the given species listed in chronological order. Each name can be an alphanumeric string. If the population classes are sex-specific, all age/stage names of one sex must be listed first, followed below by the age/stage names of the other sex.Subregions (required)- The top-most row should contain the subregion names considered by the model. Each name can be an alphanumeric string. If the AOI shapefile is to be provided, the subregion entries must each match a corresponding ‘Name’ attribute value in a feature of the AOI shapefile. An entry must be provided even if the model is considering only one subregion.Survival Rates from Natural Mortality Matrix (required)- Each unique pair of age/stage and subregion should contain a survival rate from natural mortality, expressed as a decimal fraction.ExploitationFraction (required)- A row starting in the first column with the label ‘ExploitationFraction’. The exploitation fraction is the proportion of the vulnerable population in each subregion that is harvested (0=0% harvested, 1=100% harvested). Each subregion is treated independently (i.e. up to 100% of the vulnerable population in each subregion may be harvested).LarvalDispersal- A row starting in the first column labeled ‘LarvalDispersal’. The larval dispersal is the proportion of the cumulative larvae pool that disperses into each subregion. Each subregion column should have a decimal to represent this. Dispersal across all subregions should add up to 1. If larval dispersal isn’t provided, larvae will be dispersed equally across all subregions.VulnFishing (required)- A column labeled ‘VulnFishing’, which is the relative vulnerability to harvest for each class. A decimal value for each class listed in this column is required. The most vulnerable age(s)/stage(s) should have a value of 1.0, indicating full vulnerability.Maturity- A column labeled ‘Maturity’. It represents the fraction of that age or stage which is mature and contributes to the spawning stock. A decimal value for each age/stage is required if maturity is included. For classes which do not reproduce, this should be 0.Duration- A column labeled ‘Duration’. This column is required for stage-based models. It represents the number of time steps for which an average individual will be in that stage before moving to the next one.Weight- A column which is required if ‘Spawners by Weight’ or ‘Harvest by Weight’ is selected. This is the average biomass of an individual of the population at each age/stage expressed in model-agnostic units and is required for each of the ages/stages listed in the classes column.","defaultValue":"itemID:","category":"","label":"Population Parameters File (.csv)","visible":true,"required":true,"tooltip":"Population Parameters File (.csv)"},{"name":"Total_Initial_Recruits","dataType":"GPDouble","description":"The initial number of recruits in the population model at time equal to zero. If the model contains multiple subregions of interest or is distinguished by sex, this value will be first divided into subregions using the LarvalDispersal vector and then further divided evenly by sex of each subregion.","defaultValue":4500000,"category":"","label":"Total Initial Recruits","visible":true,"required":true,"tooltip":"Total Initial Recruits"},{"name":"Recruitment_Function_Type","dataType":"GPString","description":"This equation will be used to calculate recruitment into each subregion in the area of interest (options: Beverton-Holt or Ricker).","defaultValue":"Beverton-Holt","category":"","choiceList":["Beverton-Holt","Ricker"],"label":"Recruitment Function Type","visible":true,"required":true,"tooltip":"Recruitment Function Type"},{"name":"Spawners_by_Individuals_or_Weight","dataType":"GPString","description":"Specifies whether the spawner abundance used in the recruitment function should be calculated in terms of number of individuals or in terms of biomass (weight). If ‘Weight’ is selected, the user must provide a ‘Weight’ vector alongside the survival matrix in the Population Parameters CSV File. The ‘Alpha’ and ‘Beta’ parameters provided by the user should correspond to the selected choice.","defaultValue":"Weight","category":"","choiceList":["Individuals","Weight"],"label":"Spawners by Individuals or Weight","visible":true,"required":true,"tooltip":"Spawners by Individuals or Weight"},{"name":"Alpha","dataType":"GPDouble","description":"Specifies the shape of the stock-recruit curve.","defaultValue":5770000,"category":"","label":"Alpha","visible":true,"required":true,"tooltip":"Alpha"},{"name":"Beta","dataType":"GPDouble","description":"Specifies the shape of the stock-recruit curve.","defaultValue":2885000,"category":"","label":"Beta","visible":true,"required":true,"tooltip":"Beta"},{"name":"Estimate_Migratory_Patterns","dataType":"GPBoolean","description":"Select this option if you wish to estimate migratory patterns","defaultValue":false,"category":"Migration Parameters","label":"Estimate Migratory Patterns (optional)","visible":true,"required":true,"tooltip":"Estimate Migratory Patterns (optional)"},{"name":"Migration_Matrix_CSV_Folder","dataType":"GPDataFile","description":"Specify the path to a folder containing a migratory matrix CSV file. Consider the following when formating the migratory CSV file:For each age/stage where migration occurs, there should be a single CSV within the migration directory. The name of the CSV can be anything, but MUST end with an underscore followed by the name of the age or stage. This MUST correspond to an age or stage within the Population Parameters CSV File. For migration from the ‘adult’ class for example, a migration file might be named ‘migration_adult.csv’. The CSV should contain nothing besides subregion names and migration values. The first row and first column should be the names of the subregions in the Population Parameters CSV File, listed in the same order. The columns represent the sources — the subregions FROM which the migration occurs; each column should therefore sum to 1. The rows represent the sinks — the subregions TO which the migration occurs. The cells within the matrix should be a DECIMAL REPRESENTATION of percentage of the source’s population which will migrate to the sink.","defaultValue":"itemID:","category":"Migration Parameters","label":"Migration Matrix CSV Files (zipped) (optional)","visible":true,"required":false,"tooltip":"Migration Matrix CSV Files (zipped) (optional)"},{"name":"Estimate_Harvest_Value","dataType":"GPBoolean","description":"Select this option if you wish to estimate harvest value.","defaultValue":true,"category":"Valuation Parameters","label":"Estimate Harvest Value (optional)","visible":true,"required":true,"tooltip":"Estimate Harvest Value (optional)"},{"name":"Fraction_of_Harvest_Kept_After_Processing","dataType":"GPDouble","description":"This is the decimal representation of the percentage of harvested catch remaining after post-harvest processing is complete.","defaultValue":0.286,"category":"Valuation Parameters","label":"Fraction of Harvest Kept After Processing (optional)","visible":true,"required":false,"tooltip":"Fraction of Harvest Kept After Processing (optional)"},{"name":"Unit_Price","dataType":"GPDouble","description":"Specifies the price per harvest unit.","defaultValue":29.93,"category":"Valuation Parameters","label":"Unit Price (optional)","visible":true,"required":false,"tooltip":"Unit Price (optional)"}],"outputParams":[{"name":"Total_Harvest","dataType":"GPFeatureRecordSetLayer","description":"","defaultValue":{"displayFieldName":"","geometryType":"esriGeometryPolygon","spatialReference":{"wkid":26716,"latestWkid":26716},"fields":[{"name":"FID","type":"esriFieldTypeOID","alias":"FID"},{"name":"Name","type":"esriFieldTypeString","alias":"Name","length":30},{"name":"Hrv_Total","type":"esriFieldTypeDouble","alias":"Hrv_Total"},{"name":"Val_Total","type":"esriFieldTypeDouble","alias":"Val_Total"},{"name":"Shape_Length","type":"esriFieldTypeDouble","alias":"Shape_Length"},{"name":"Shape_Area","type":"esriFieldTypeDouble","alias":"Shape_Area"}],"features":[],"exceededTransferLimit":false},"category":"","label":"Total Harvest","visible":true,"required":false,"featureSetMode":"layers"},{"name":"Harvest_Value_Table","dataType":"GPDataFile","description":"","defaultValue":null,"category":"","label":"Harvest Value Table","visible":true,"required":false,"tooltip":"Harvest Value Table","ignore":false,"layerInvisible":false},{"name":"Results_Summary","dataType":"GPDataFile","description":"","defaultValue":null,"category":"","label":"Results Summary Table","visible":true,"required":false,"tooltip":"Results Summary Table","ignore":false,"layerInvisible":false},{"name":"Geoprocessing/FisheriesHarvest","label":"Fisheries Harvest Map","tooltip":"Fisheries Harvest Map","dataType":"MapServiceLayer","layerNames":["Fisheries Harvest","Total Harvest"],"visible":true,"required":"","defaultValue":null,"ignore":false,"layerInvisible":false}],"shareResults":true,"layerOrder":["Total_Harvest"],"showExportButton":true}
