define({
  "_widgetLabel": "Επιλογή",
  "showActions": "Εμφάνιση ενεργειών σε επιλεγμένα στοιχεία",
  "toggleSelectability": "Κάντε κλικ για εναλλαγή της επιλογής",
  "showSelectedFeatures": "Κάντε κλικ για να εμφανιστούν τα επιλεγμένα στοιχεία",
  "actionsTitle": "Ενέργειες επιλογής",
  "turnonAll": "Όλα τα θεματικά επίπεδα να γίνουν επιλέξιμα",
  "turnoffAll": "Όλα τα θεματικά επίπεδα να γίνουν μη επιλέξιμα",
  "toggleSelect": "Εναλλαγή δυνατότητας επιλογής για όλα τα θεματικά επίπεδα",
  "singleSelect": "Να γίνει το συγκεκριμένο το μόνο επιλέξιμο θεματικό επίπεδο"
});