define({
  "_widgetLabel": "Выбрать",
  "showActions": "Показать действия для выбранных объектов",
  "toggleSelectability": "Щелкните, чтобы переключить доступность для выборки",
  "showSelectedFeatures": "Щелкните, чтобы показать выбранные объекты",
  "actionsTitle": "Действия с выборкой",
  "turnonAll": "Сделать все слои доступными для выборки",
  "turnoffAll": "Сделать все слои не доступными для выборки",
  "toggleSelect": "Переключить доступность для выборки для всех слоев",
  "singleSelect": "Сделать только этот слой доступным для выборки"
});